[DIALOG_102]
BUTTON_1002=选择固件
BUTTON_1004=选择Demo
BUTTON_1005=开始创建
BUTTON_1011=恢复磁盘
BUTTON_1013=固件升级
BUTTON_1014=PCBA测试
DIALOG_TITLE=瑞芯微创建升级磁盘工具
LABEL_1006=第一步:选择可移动磁盘设备
LABEL_1012=第二步:选择功能模式
LABEL_1007=第三步:选择升级固件
LABEL_1008=第四步:选择Demo数据(可选)
LABEL_1009=
LABEL_1010=
LABEL_1015=

[Prompt]
IDS_BROWSE_DEMO_TITLE=选择Demo
ERROR_ACTION_RUN=正在执行操作,请稍后退出!
INFO_CREATEDISK_CONFIRM=创建升级磁盘,磁盘上数据将会丢失,是否继续?
INFO_RESTOREDISK_CONFIRM=恢复磁盘,磁盘上数据将会丢失,是否继续?
ERROR_BOOT_NO_EXIST=SDBoot.bin不存在!
ERROR_BOOTCONFIG_NO_EXIST=sd_boot_config.config不存在!
ERROR_IMAGE_NO_EXIST=升级固件不存在!
ERROR_IMAGE_OPEN_FAIL=升级固件打开失败!
ERROR_DISK_NO_FOUND=不存在制作升级固件磁盘!
ERROR_DISK_NO_SELECT=磁盘未选择!
ERROR_DISK_CREATE_FAIL=创建磁盘对象失败!
ERROR_DISK_OPEN_FAIL=打开磁盘对象失败!
ERROR_NO_REMOVABLE_DISK=当前选中磁盘非可移动磁盘!
INFO_EJECT_MEDIA=开始卸载介质...
ERROR_EJECT_MEDIA_FAIL=卸载介质失败!
INFO_SET_MBR=开始写入MBR...
ERROR_SET_MBR_FAIL=写入MBR失败!
INFO_WRITE_LOADER=开始写入Loader...
ERROR_WRITE_LOADER_FAIL=写入Loader失败!
INFO_WRITE_PARAMETER=开始写入Parameter...
ERROR_WRITE_PARAMETER_FAIL=写入Parameter失败!
INFO_WRITE_RECOVERY=开始写入Recovery...
ERROR_WRITE_RECOVERY_FAIL=写入Recovery失败!
INFO_LOAD_MEDIA=开始加载介质...
ERROR_LOAD_MEDIA_FAIL=加载介质失败!
INFO_FORMAT_USER=开始格式化用户盘...
ERROR_GET_USERDISK_FAIL=查找用户盘失败!
ERROR_USERDISK_NOFOUND=不存在用户盘!
ERROR_FORMAT_USERDISK_FAIL=格式化用户盘失败!
INFO_COPY_FIRMWARE_DEMO=开始拷贝固件和Demo...
ERROR_COPY_FIRMWARE_DEMO_FAIL=拷贝固件和Demo失败!
INFO_CREATEUPGRADEDISK_OK=创建升级磁盘成功.
INFO_RESTORE_MBR=开始恢复MBR...
ERROR_RESTORE_MBR_FAIL=恢复MBR失败!
INFO_RESTOREUPGRADEDISK_OK=恢复磁盘成功.
ERROR_INITIALIZE_FAIL=程序初始化失败,无法进行操作!
INFO_COPY_FIRMWARE=开始拷贝固件...
ERROR_COPY_FIRMWARE_FAIL=拷贝固件失败!
INFO_COPY_DEMO=开始拷贝Demo...
ERROR_COPY_DEMO_FAIL=拷贝Demo失败!

